Table of Contents
 Class ResultClass
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
ResultClass object
[OpenModelClass("CI.StructModel.Loading.ResultClass,CI.Loading", "CI.StructModel.Loading.IResultClass,CI.BasicTypes", typeof(ResultClass))]
public class ResultClass : OpenElementId
Inheritance
object
OpenObject
OpenElementId
ResultClass
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultClass()
constructor
public ResultClass()
Properties
 Description
Description of IResultClass
public string Description { get; set; }
Property Value
string
 IdConstructionStage
Id of IConstructionStage, 0 == IConstructionStage is not defined
public int IdConstructionStage { get; set; }
Property Value
int
 ListItem
List of objects in this library
public List<SelectionItemForResults> ListItem { get; set; }
Property Value
List<SelectionItemForResults>
 Name
Name of ResultClass
public string Name { get; set; }
Property Value
string
 Nonlinear
Class contains nonlinear combinations (loaded as loadcase)
public bool Nonlinear { get; set; }
Property Value
bool
 TypeResultClass
TypeResultsClass
public TypeResultsClass TypeResultClass { get; set; }
Property Value
TypeResultsClass
 TypeUpdateResultClass
Type of update RC. If TypeUpdateResultClass is Update, ListItem will be updated
public TypeUpdateResultClass TypeUpdateResultClass { get; set; }
Property Value
TypeUpdateResultClass
 Edit this page